Autodesk.Revit.DB.IModelExportContextWithSolid.OnSolidEnd(Autodesk.Revit.DB.SolidNode)
This method marks the end of the current Solid being exported.
node:
An output node that represents a Solid.
Since:
2021

Autodesk.Revit.DB.IModelExportContextWithSolid.OnSolidBegin(Autodesk.Revit.DB.SolidNode)
This method is called when a Solid is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
node:
An output node that represents a Solid.
Returns:
Return RenderNodeAction.Proceed if you wish to receive low-level geometry
(faces) for this Solid, or otherwise return RenderNodeAction.Skip.
Since:
2021

Autodesk.Revit.DB.IModelExportContextWithSolid
An interface that is used in custom export to export 3D views of a Revit model with Solids.
Remarks:
An instance of a class that implements this interface is passed in as a
parameter of the Autodesk.Revit.DB.CustomExporter constructor.
The interface methods are then called at times of drawing entities that are
currently visible in the view being exported.
With this type of export context used to perform a custom export,
Revit will traverse the model and output the model's geometry
as if in the process of regular displaying or exporting a 3D View.
It means that any geometry which is visible in an open view
(taking any current visibility setting applicable to the view)
will be processed and output.
Since:
2021